app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-11-03 22:01:42.570553"], ["updated_at", "2018-11-03 22:01:42.570553"]]
---
  def create
    title = params[:post][:title]
    description = params[:post][:description]
    Post.create(title: title, description: description)